var navthe=document.getElementsByClassName('navthe');
var np=navthe[0].getElementsByTagName('p');
console.log(np);
np[0].innerHTML="有些路，走下去会很苦很累，但是不走会后悔。 没人心疼，也要坚强；没人鼓掌，也要飞翔，要记住越努力，越幸运。 人贵在行动，只有努力了梦想才能实现。前进不必遗憾， 若美好，叫做精彩； 若糟糕，叫做经历。 好好去爱，去生活，每天的太阳都是新的，别辜负了美好时光。 你若盛开，蝴蝶自来； 你若精彩，天自安排。";

var txt=document.getElementsByClassName('alltext');
var hh=txt[0].getElementsByTagName('h1');
var pp=txt[0].getElementsByTagName('p');
// 注意pp索引,一个box里有2个p
hh[0].innerHTML="我的第一个博客";
hh[1].innerHTML="天空不作美";
hh[2].innerHTML="本无心";
hh[3].innerHTML="莫皆星空";
pp[0].innerHTML="黑夜升起来，风声带来了雨声。这是春天的第一场雨，像神灵的絮语，万物都在叫喊，在雨水里醒来。一朵蒲公英在练习飞翔，它愈飞愈高，被突然到来的鸟翅带走了。鸟总是既孤单又迷人，他们会去你永远也不知道的地方。夕阳下山前，村庄通红，原野上铺满黄金，那些堆放在路边的陈年柴垛燃起火焰。广阔的树林里，起了风，杏花在跌落，悄然，像一盏灯熄灭。我伫立在火焰旁，我想说，请等一等。随黑夜回到山中，车行得急，举目朝窗外看，大海挂在头顶，金黄的月亮在飞行，带着群星飞行。风吹燕山，寂静无声，山上满是吹散的白云，那些白云闪闪，是我四散的弟兄。";
pp[1].innerHTML="不乱于心，不困于情。不畏将来，不念过往。如此，安好";
pp[2].innerHTML="醉过才知酒浓，爱过才知情重。你不能做我的诗，正如我不能做你的梦。";
pp[3].innerHTML="闭上眼睛，安静内心告诉自己。别人想什么，我们控制不了；别人做什么，我们也强求不了。唯一可以做的，就是尽心尽力做好自己的事，走自己的路，按自己的原则，好好生活。<br />&nbsp;&nbsp;&nbsp;&nbsp;你永远不知道在别人口中的你会有多少版本，也不会知道别人为了维护自己而说过什么去诋毁你，更无法阻止那些不切实际的闲话。而你能做的就是置之不理，更没必要去解释澄清，懂你的人永远相信你。";
pp[4].innerHTML="大概因为再多的喜欢，也换不来未来。";
pp[5].innerHTML="在青山绿水之间，我想牵着你的手，走过这座桥，桥上是绿叶红花，桥下是流水人家，桥的那头是青丝，桥的这头是白发。"
pp[6].innerHTML="我的不开心，我的难受，我都尽量留给了自己，不吵不闹不炫耀，不要委屈不要嘲笑，也不需要别人知道。有太多话想说，但是往往到最后还是通通收了回来。所谓成长也许就是将哭声调成静音的过程，把情绪收到别人看不到的地方，一个人学会坚强。";
pp[7].innerHTML="Everything is a price, the price of happiness is pain.";
